<?php

/**
 * 工具类脚本
 */
class ToolCommand extends CConsoleCommand
{
    /**
     * 同步本地静态文件到七牛
     */
    public function actionQnSync()
    {
        $basePath = Yii::app()->basePath;
        $baseDir = Yii::app()->name;
        $date = date('YmdHis');
        $QnUrl = Yii::app()->staticFile->host.'/';
        $fileArr = [
            'pro.js' => '/resoldwap/build/pro.js'
        ];
        echo "Start Sync:\n";
        echo "Version:{$date}\n";
        echo "==========================\n";
        foreach ($fileArr as $name => $path) {
            $path = $basePath.'/../'.$path;
            $extPath = $baseDir.'/'.$date.'/'.$name;
            $r = Yii::app()->staticFile->consoleFileUpload($path, $extPath);

            if (isset($r['key'])) {
                echo $QnUrl.$r['key']."\n";
            } else {
                var_dump($r);
            }
        }
    }
    public function actionDo()
    {
        // $infos = PlotExt::model()->normal()->findAll();
        // // var_dump(count($infos));exit;
        // foreach ($infos as $key => $value) {
        //     // if(!$value->first_pay && $value->pays) {
        //     //     $value->first_pay = $value->pays[0]['price'];
        //     // }
        //     $value->save();
        //     // sleep(1);
        // }
        echo "ok";
    }

    public function actionAddPlotViews()
    {
        $hids = Yii::app()->redis->getClient()->hGetAll('plot_views');
        // var_dump($hids);exit;
        if($hids) {
            foreach ($hids as $key => $value) {
                $plot = PlotExt::model()->findByPk($key);
                if(!$plot) {
                    continue;
                }
                $plot->views+=$value;
                $plot->save();
                Yii::app()->redis->getClient()->hSet('plot_views',$key,0);
            }
        }
        echo "finished";
    }

    public function actionClearTop()
    {
        $plots = PlotExt::model()->findAll('top_time<'.time());
        if($plots) {
            foreach ($plots as $key => $value) {
                $value->sort = 0;
                $value->save();
            }
        }
    }

    public function actionClearListCache()
    {
        // wap_init_plotlist
        CacheExt::delete('wap_init_plotlist');
    }

    public function actionSendNo()
    {
        $infos = UserExt::model()->findAll('vip_expire>'.time().' and vip_expire<'.time()+86400*3);
        // $infos = PlotMarketUserExt::model()->findAll('expire>'.time().' and expire<'.time()+86400*3);
        foreach ($infos as $key => $user) {
            if($user && $user->phone) {
                SmsExt::sendMsg('会员到期通知',$user->phone,['phone'=>SiteExt::getAttr('qjpz','site_wx'),'name'=>$user->name]);
            }
            // $user = $value->user;
            if($user&&$user->qf_uid) {
                Yii::app()->controller->sendNotice($user->name.'您好，您的新房通VIP会员即将到期，请点击以下链接自助续费: http://house.jj58.com.cn/api/index/vip ，或者联系客服微信:'.SiteExt::getAttr('qjpz','site_wx').'协助续费。',$user->qf_uid);
                // if($p = $value->plot) {
                //     SmsExt::sendMsg('到期通知',$user->phone,['pro'=>$p->title]);
                //     Yii::app()->controller->sendNotice('您的项目'.$p->title.'即将到期，请点击下面链接成为会员，成为会员后您的号码将继续展现，并且可以无限次数发布项目。 http://house.jj58.com.cn/api/index/vip',$user->qf_uid);
                // }
            }
        }
    }

    public function actionAddIt()
    {
$arr = [['company'=>'吴中区甪直镇恒信房产中介服务所','name'=>  '吴志刚','phone'=> '13382513088','addr'=>'甪直镇晓市路91号'],
['company'=>'昆山盛美房地产投资管理有限公司','name'=>  '盛斌','phone'=>  '18550075729','addr'=>'昆山周庄镇大桥路296号'],
['company'=>'苏州住美房产经纪有限公司','name'=> '许舜查','phone'=> '15850195396','addr'=>'苏州工业园区沈浒路588号新未来花园74幢105室'],
['company'=>'苏州易百年房地产经纪有限公司','name'=>   '戴丹丹','phone'=> '18261848200','addr'=>'苏州工业园区沈浒路588号新未来花园30幢107室'],
['company'=>'苏州顺泽房地产营销策划有限公司','name'=>  '管锋','phone'=>  '13962135524','addr'=>'苏州工业园区唯亭金陵西路168号1幢258室'],
['company'=>'苏州优家优美房产经纪有限公司','name'=>   '田小敏','phone'=> '18136140612','addr'=>'苏州工业园区唯亭跨南路2号大丰收商业广场5幢210室'],
['company'=>'吴中区甪直我爱我家房产中介服务所','name'=> '赵凤花','phone'=> '13606260685','addr'=>'苏州市吴中区甪直镇晓市路91号'],
['company'=>'昆山市花桥镇德铭房产经纪事务所','name'=>  '董德燕','phone'=> '15995646932','addr'=>'花桥镇商银路1532号'],
['company'=>'昆山置轩不动产投资咨询有限公司','name'=>  '薛菲','phone'=>  '15150797475','addr'=>'花桥镇香榭丽大道761号'],
['company'=>'昆山鸿都房产咨询有限公司','name'=> '李金全','phone'=> '13681661520','addr'=>'花桥镇香榭丽大道795号'],
['company'=>'昆山房尚房房地产经济有限公司','name'=>   '王战营','phone'=> '18501667861','addr'=>'花桥镇绿地大道258号-1-1-102室'],
['company'=>'苏州中萨房产经纪有限公司','name'=> '陈威','phone'=>  '18913556918','addr'=>'苏州工业园区东环路1408号1幢908室'],
['company'=>'昆山市吉信房产咨询有限公司','name'=>    '严雪芬','phone'=> '13382153088','addr'=>'昆山市张浦镇新吴街821号'],
['company'=>'昆山市吉信房产咨询有限公司','name'=>    '严雪芬','phone'=> '15950154112','addr'=>'昆山市张浦镇新吴街821号'],
['company'=>'昆山祥居房产咨询有限公司','name'=> '龚斌','phone'=>  '13912665447','addr'=>'张浦镇新吴街727号'],
['company'=>'苏州隆易居不动产经纪有限公司','name'=>   '晁晴','phone'=>  '13814868810','addr'=>'苏州工业园区海悦花园一区5幢117室'],
['company'=>'苏州锐奥房产经纪有限公司','name'=> '国乐庆','phone'=> '13402676176','addr'=>'苏州工业园区东沙湖路100号1幢407'],
['company'=>'苏州福源久房产管理有限公司','name'=>    '孙尚斌','phone'=> '18252999009','addr'=>'苏州市吴中区甪直镇地园新村1幢102室'],
['company'=>'甪直家顺房产中介服务部','name'=>  '朱花仙','phone'=> '13616212416','addr'=>'苏州市吴中区甪直镇晓市路97号'],
['company'=>'甪直诚达房产服务所','name'=>    '沈寒仙','phone'=> '13914037163','addr'=>'苏州市吴中区甪直镇晓市路107号'],
['company'=>'甪直人和房产中介服务部','name'=>  '肖佳楠','phone'=> '13913579456','addr'=>'苏州市吴中区甪直镇晓市路82号'],
['company'=>'苏州麟轩不动产经纪有限公司','name'=>    '张敏','phone'=>  '15365380566','addr'=>'苏州工业园区沈浒路588号新未来花园30幢108室'],
['company'=>'昆山菲翎房地产咨询有限公司','name'=>    '唐菲翎','phone'=> '18662655823','addr'=>'昆山开发区夏荷路99号港龙商务大厦1号楼1505室'],
['company'=>'苏州尚美世居房地产经纪有限公司','name'=>  '高利明','phone'=> '18061936632','addr'=>'苏州工业园区嘉瑞巷8号乐嘉大厦1幢2123室'],
['company'=>'苏州爱居易房地产经纪有限公司','name'=>   '汪松涛','phone'=> '13451621522','addr'=>'苏州工业园区星湖街833号荣域花园商业2幢805-106'],
['company'=>'苏州东城世纪不动产经纪有限公司','name'=>  '钱洪江','phone'=> '13812665713','addr'=>'苏州工业园区丽帆巷15号海悦花园四区15幢105室'],
['company'=>'苏州美智园房地产经纪有限公司','name'=>   '季自龙','phone'=> '13962194738','addr'=>'苏州工业园区榭雨街329号太阳星辰花园三区78幢114室'],
['company'=>'苏州逸飞房产经纪有限公司','name'=> '汪王飞','phone'=> '18913588885','addr'=>'苏州工业园区淞江路218号蓝岸花园27幢106室'],
['company'=>'昆山苏成家园房地产咨询有限公司','name'=>  '计永亮','phone'=> '13952450359','addr'=>'周庄镇淀南东路1号商住楼'],
['company'=>'苏州博明房产经纪有限公司','name'=> '鹿振','phone'=>  '13814892629','addr'=>'苏州工业园区海悦花园五区2幢112室'],
['company'=>'苏州盛域房产经纪有限公司','name'=> '李光顺','phone'=> '18913139151','addr'=>'苏州工业园区星湖街333号荣域花园商业2幢819室'],
['company'=>'苏州宜居宜家房地产经纪有限公司','name'=>  '朱云云','phone'=> '15051571863','addr'=>'苏州工业园区高和路城邦花园67号298幢109室'],
['company'=>'昆山市周庄佳悦祥房产中介服务部','name'=>  '李玉荣','phone'=> '15995634849','addr'=>'周庄镇云海路48号'],
['company'=>'苏州市吴中区甪直良友房产中介服务所','name'=>    '曹素荣','phone'=> '13584814650','addr'=>'苏州市吴中区甪直镇西市上塘街58号'],
['company'=>'苏州市吴中区甪直亿家人房产中介服务部','name'=>   '李玉兵','phone'=> '17768015801','addr'=>'苏州市吴中区甪直镇晓市路79号'],
['company'=>'苏州市轩辕不动产投资咨询有限公司','name'=> '田娟','phone'=>  '18362696012','addr'=>'海悦花园五区2幢113号'],
['company'=>'苏州苏城万家房地产经纪有限公司','name'=>  '邓宜','phone'=>  '15190007391','addr'=>'苏州工业园区娄葑镇东延路116号1幢126室'],
['company'=>'苏州苏悦房产经纪有限公司','name'=> '徐洪英','phone'=> '15050451084','addr'=>'苏州工业园区顺达商业广场1幢416室'],
['company'=>'苏州志远地产经纪有限公司','name'=> '姜精燕','phone'=> '18351119761','addr'=>'苏州工业园区钟慧路92号92幢102室'],
['company'=>'苏州市欣成雅居房地产投资咨询有限公司','name'=>   '刘亚雪','phone'=> '18013575412','addr'=>'苏州工业园区星湖街999号99幢906室'],
['company'=>'苏州佐佑房地产经纪有限公司','name'=>    '潘荣','phone'=>  '15995890380','addr'=>'苏州工业园区星州街1号296幢101室'],
['company'=>'苏州鼎城不动产经纪有限公司','name'=>    '丁哲','phone'=>  '18915405801','addr'=>'苏州工业园区通园路339号2幢203室'],
['company'=>'昆山市锦溪镇锦灵佳苑信息咨询服务部','name'=>    '邵云雅','phone'=> '18915482139','addr'=>'锦溪镇长寿东路905号'],
['company'=>'甪直金三元房产中介服务部','name'=> '赵小弟','phone'=> '13914010386','addr'=>'苏州市吴中区甪直镇晓市路'],
['company'=>'吴中区甪直宏达房产中介服务部','name'=>   '宋子龙','phone'=> '15724869422','addr'=>'苏州市吴中区甪直镇晓市路97号'], 
['company'=>'苏州巨擘投资管理咨询有限公司','name'=>   '高洋','phone'=>  '15358471326','addr'=>'苏州市宝带西路1177号1幢1309室'],
['company'=>'昆山恒悦房产资询有限公司','name'=> '屈春旗','phone'=> '13862652587','addr'=>'张浦镇学士路841号'],
['company'=>'昆山市久德房产咨询有限公司','name'=>    '徐荣','phone'=>  '13338648688','addr'=>'张浦镇商鞅路300号'],
['company'=>'苏州泰旭房产经纪有限公司','name'=> '金文杰','phone'=> '13776036452','addr'=>'苏州工业园区葑谊街266号1幢105室'],
['company'=>'昆山市众联世纪房地产咨询有限公司','name'=> '华锐','phone'=>  '15950188810','addr'=>'昆山市玉山镇虹桥路525号'],
['company'=>'苏州市新时代房屋经纪有限公司园区双湖店','name'=>  '顾文清','phone'=> '13584851799','addr'=>'苏州工业园区星湖街1192号'],
['company'=>'苏州聚合升房产经纪有限公司','name'=>    '周曼华','phone'=> '13616266222','addr'=>'苏州工业园区钟慧路82号82幢103室'],
['company'=>'苏州宜家宜舍房屋经纪有限公司','name'=>   '马东','phone'=>  '15051414160','addr'=>'苏州工业园区海悦花园一区3幢106室'],
['company'=>'昆山恒远房产信息咨询有限公司','name'=>   '郭福龙','phone'=> '15995658897','addr'=>'千灯镇黄浦中路232号'],
['company'=>'昆山耀德房地产经纪有限公司','name'=>    '张文浩','phone'=> '15850318771','addr'=>'昆山开发区夏荷路99号港龙商务大厦1号楼1309室'],
['company'=>'昆山众家房地产经纪有限公司','name'=>    '张赤寒','phone'=> '18662356349','addr'=>'昆山开发区蓬朗新星中路蓬曦园C6组团沿街商业店面B区'],
['company'=>'苏州舒馨美地不动产经纪有限公司','name'=>  '袁敏','phone'=>  '18344687753','addr'=>'江苏省苏州市工业园区378号2幢104室'],
['company'=>'苏州泰森房地产经纪有限公司','name'=>    '唐虎','phone'=>  '13092604112','addr'=>'苏州工业园区中海花园27幢105室'],
['company'=>'苏州启源房地产经纪有限公司','name'=>    '孙凤合','phone'=> '13962156388','addr'=>'苏州市西花桥巷1号'],
['company'=>'苏州工业园区娄葑镇车坊三和房产信息咨询服务部','name'=>   '张晓雷','phone'=> '15995413577','addr'=>'车坊高垫路吉祥楼8号'],
['company'=>'昆山全家福房产咨询有限公司','name'=>    '祁霞','phone'=>  '15051654331','addr'=>'昆山市张浦镇新吴街737号'],
['company'=>'昆山优美家投资咨询有限公司','name'=>    '王晓刚','phone'=> '13338646621','addr'=>'昆山市花桥镇原地大道231弄8号803室'],
['company'=>'昆山市千灯镇永恒之星房产中介服务中心','name'=>   '丁芳','phone'=>  '15051635348','addr'=>'昆山市千灯镇景唐北路671号'],
['company'=>'昆山市花桥镇喜乐家房产中介所','name'=>   '安鹏武','phone'=> '13405223477','addr'=>'昆山市花桥镇大上海国际商贸中心7号楼210-4室'],
['company'=>'昆山新恒基房产投资顾问有限公司','name'=>  '刘小溪','phone'=> '18068069129','addr'=>'昆山市千灯镇景泾路226路'],
['company'=>'北京怡然居客科技发展有限公司苏州分公司','name'=>  '李海','phone'=>  '13771930910','addr'=>'苏州工业园区娄葑镇东环路1408号1幢1905室'],
['company'=>'苏州骏腾房产经纪有限公司','name'=> '吴亚平','phone'=> '18662438687','addr'=>'苏州工业园区北摆宴街通园大厦1幢105室'],
['company'=>'昆山市千灯镇聚本房产中介所','name'=>    '黄延宝','phone'=> '15867789231','addr'=>'千灯镇景泾路317号'],
['company'=>'吴中经济开发区广源房产中介服务部','name'=> '马淑兰','phone'=> '18061931681','addr'=>'苏州吴中经济开发区东吴南路苏粤小区3幢10室'],
['company'=>'苏州家之翼房产经纪有限公司','name'=>    '吴城','phone'=>  '13812786334','addr'=>'苏州工业园区凇江路208号2#幢105室'],
['company'=>'苏州一诺房地产经纪有限公司','name'=>    '王富林','phone'=> '13962169579','addr'=>'苏州市竹辉路149号'],
['company'=>'苏州市平江区乾坤房屋中介服务部','name'=>  '孙海民','phone'=> '18936086758','addr'=>'永林二区43幢-5号'],
['company'=>'苏州润亿家房地产经纪有限公司','name'=>   '凌君','phone'=>  '18862322109','addr'=>'苏州市吴中区迎春路77号'],
['company'=>'苏州工业园区久居房产中介有限公司','name'=> '苏明聪','phone'=> '18151088282','addr'=>'苏州工业园区通园大厦2幢106室'],
['company'=>'苏州佳乐居房地产经纪有限公司','name'=>   '郑朝晖','phone'=> '13405044559','addr'=>'苏州工业园区海悦花园12商幢106室'],
['company'=>'苏州工业园区弘福世居房地产经纪有限公司','name'=>  '段秀芳','phone'=> '15606229699','addr'=>'苏州工业园区东湖大郡花园155幢1103室'],
['company'=>'苏州幸福万家房地产经纪有限公司','name'=>  '谢焕章','phone'=> '18626168678','addr'=>'苏州工业园区凇江路266号橄榄湾花园13幢104室'],
['company'=>'苏州德义馨房地产经纪有限公司','name'=>   '郑飞','phone'=>  '15262495182','addr'=>'苏州工业园区海悦花园一区3幢105室'],
['company'=>'昆山市伊诺房产咨询有限公司','name'=>    '王亚莉','phone'=> '18912693337','addr'=>'玉山镇时家园6号楼106室'],
['company'=>'苏州我爱我家房地产经纪有限公司','name'=>  '王健浩','phone'=> '13706218198','addr'=>'苏州工业园区星湖街833号荣域花园商业2幢827室'],
['company'=>'苏州择安居房地产经纪有限公司','name'=>   '黄天根','phone'=> '15106255253','addr'=>'苏州工业园区唯亭唯华路2号和泰都市生活广场2幢514室'],
['company'=>'苏州工业园区合创房产经纪有限公司','name'=> '张雪金','phone'=> '18896968001','addr'=>'苏州工业园区葑亭大道599号金锦苑29幢102室'],
['company'=>'沧浪区悦驰房屋信息咨询服务部','name'=>   '陆国华','phone'=> '13771838606','addr'=>'苏州市沧浪区竹辉路138号'],
['company'=>'苏州星客屋投资管理有限公司','name'=>    '李正元','phone'=> '13402641112','addr'=>'苏州市混堂巷27-1号'],
['company'=>'苏州工业园区新四维房产咨询服务有限公司','name'=>  '王俊','phone'=>  '13913529278','addr'=>'苏州工业园区星港街中天湖畔广场129号'],
['company'=>'苏州汉原房地产经纪有限公司','name'=>    '张影','phone'=>  '13915566879','addr'=>'苏州工业园区星湖街867号'],
['company'=>'苏州博易居不动产经纪有限公司','name'=>   '潘卫东','phone'=> '15062356237','addr'=>'苏州工业园区中海海悦花园四区15幢128号'],
['company'=>'苏州工业园区日加房地产经纪有限公司','name'=>    '姚伟林','phone'=> '13915574290','addr'=>'苏州工业园区中天湖畔生活广场1幢138室'],
['company'=>'昆山安信房产咨询有限公司','name'=> '陈群','phone'=>  '13773157150','addr'=>'江苏省苏州市昆山市周庄镇大桥路'],
['company'=>'苏州名城家业不动产经纪有限公司园区分公司','name'=> '施劲贵','phone'=> '18962181098','addr'=>'苏州工业园区自由水岸花园15商幢105室'],
['company'=>'苏州优客房产经纪有限公司','name'=> '杨从林','phone'=> '13962121141','addr'=>'苏州吴中经济开发区石湖东路100-14号'],
['company'=>'昆山六一八房地产经纪有限公司','name'=>   '刘艳','phone'=>  '15850311508','addr'=>'昆山市千灯镇南浦东路234号'],
['company'=>'苏州易兴博房产经纪有限公司','name'=>    '吉开建','phone'=> '13706202367','addr'=>'苏州工业园区加城花园东门22幢002室'],
['company'=>'苏州链家房地产经纪有限公司','name'=>    '左晖','phone'=>  '13338668637','addr'=>'苏州市东环路飘一路8号'],
['company'=>'苏州中驰房地产经纪有限公司','name'=>    '施潇伟','phone'=> '18012624446','addr'=>'苏州工业园区九华路88号12幢106号商铺'],
['company'=>'昆山市千灯镇立好信房屋中介所','name'=>   '陈兆龙','phone'=> '15358831781','addr'=>'千灯镇南浦东路112号'],
['company'=>'苏州柯尔美房地产营销策划有限公司','name'=> '肖华','phone'=>  '13616273191','addr'=>'苏州工业园区苏虹中路225号星虹大厦1幢2107室'],
['company'=>'苏州君有房地产营销策划有限公司','name'=>  '王二海','phone'=> '13914034786','addr'=>'苏州工业园区唯亭镇唯华路2号和泰都市生活广场1幢318室'],
['company'=>'苏州博琨房地产经纪有限公司','name'=>    '陈绪林','phone'=> '13776027983','addr'=>'苏州工业园区榭雨街329号太阳星辰花园三区78幢116室'],
['company'=>'苏州千鸿不动产经纪有限公司','name'=>    '闫红曼','phone'=> '13390889030','addr'=>'苏州工业园区自由水岸花园15商幢104室'],
['company'=>'苏州名居屋房地产经纪有限公司','name'=>   '胡光庆','phone'=> '15995442951','addr'=>'苏州工业园区嘉瑞巷8号乐嘉大厦1幢520室'],
['company'=>'苏州工业园区乐利置业经纪有限公司','name'=> '吉如军','phone'=> '15162497102','addr'=>'苏州工业园区沈浒路588号新未来花园68商幢'],
['company'=>'昆山合兴达装饰工程有限公司','name'=>    '吴环加','phone'=> '13962458161','addr'=>'千灯镇汇丰商贸广场16号楼10室'],
['company'=>'苏州工业园区金丰易居不动产经纪有限公司','name'=>  '王海英','phone'=> '13915576176','addr'=>'苏州工业园区文萃路39-55幢39室'],
['company'=>'苏州圣客居房地产经纪有限公司','name'=>   '杨于杰','phone'=> '13913188829','addr'=>'苏州工业园区星湖街1338号'],
['company'=>'苏州福祥居房地产经纪有限公司','name'=>   '徐迎春','phone'=> '18951118484','addr'=>'苏州吴中经济开发区郭巷街道双银国际金融城7幢311号'],
['company'=>'苏州浩博房地产经纪有限公司','name'=>    '朱振洪','phone'=> '13913596427','addr'=>'苏州高新区几十年韩璐狮山新苑61幢6号'],
['company'=>'苏州工业园区弘涛旺佳房地产经纪有限公司','name'=>  '宋振','phone'=>  '18915434088','addr'=>'苏州工业园区唯华路3号君地商务广场5幢1017室'],
['company'=>'苏州市平江区日规之家房产中介服务部','name'=>    '卢佩娟','phone'=> '18962132810','addr'=>'日规路1号托儿所边东1'],
['company'=>'昆山市千灯镇卡米华信房产中介所','name'=>  '顾华','phone'=>  '13358056318','addr'=>'千灯镇景泾路351号'],
['company'=>'昆山问鼎房地产营销策划有限公司','name'=>  '邵世玉','phone'=> '15762290555','addr'=>'千灯镇南浦东路120号'],
['company'=>'昆山市齐家房产中介有限公司','name'=>    '张金平','phone'=> '15050207878','addr'=>'张浦镇俱巷路946号'],
['company'=>'吴中经济开发区万盛房产中介服务部','name'=> '万宝金','phone'=> '15050494480','addr'=>'苏州吴中经济开发区苏州服装城5号'],
['company'=>'苏州地平线房地产经纪有限公司','name'=>   '倪春雨','phone'=> '15850982007','addr'=>'苏州市西园路430号1幢108室'],
['company'=>'苏州市云宏房产中介有限公司','name'=>    '孙根红','phone'=> '18662249178','addr'=>'苏州市凤凰街56号'],
['company'=>'昆山市鑫典房产有限公司','name'=>  '潘雪芹','phone'=> '15850325013','addr'=>'昆山市张浦镇俱巷路938号'],
['company'=>'昆山德邦美达房地产经纪有限公司','name'=>  '夏前龙','phone'=> '18626195458','addr'=>'花桥镇绿地大道258号-1-5-20室'],
['company'=>'苏州温雅居房产经纪有限公司','name'=>    '范浩磊','phone'=> '15850166313','addr'=>'苏州高新区玉山路名馨花园26-04'],
['company'=>'昆山柏祥房地产咨询有限公司','name'=>    '周葛亮','phone'=> '13584905193','addr'=>'张浦镇俱巷路922号'],
['company'=>'苏州汇露房地产营销策划有限公司','name'=>  '刘冬冬','phone'=> '18752718835','addr'=>'苏州市姑苏区石路协和大厦2005室'],                     
['company'=>'昆山市千灯镇安顺房屋中介所','name'=>    '李红','phone'=>  '13732669085','addr'=>'千灯镇地安国际花园6号楼17室'], 
['company'=>'昆山禾安房产经纪有限公司','name'=> '张建国','phone'=> '15950151619','addr'=>'昆山市千灯镇南浦东路218号'],
['company'=>'昆山儒政房产营销策划有限公司','name'=>   '张建财','phone'=> '15950176829','addr'=>'千灯镇人和路218号'],
['company'=>'苏州易扬典居房产经纪有限公司','name'=>   '花尧','phone'=>  '15962192457','addr'=>'苏州工业园区苏州大道东381号商旅大厦6幢1104室'],
['company'=>'苏州远熙不动产经纪有限公司','name'=>    '吴磊','phone'=>  '13814876629','addr'=>'苏州工业园区东湖大郡花园二期东门'],
['company'=>'苏州联创中天房地产经纪有限公司','name'=>  '顾磊','phone'=>  '18112557879','addr'=>'九华路88号中央景城12幢商铺103室'],
['company'=>'苏州璟鑫房地产营销策划有限公司','name'=>  '李连芬','phone'=> '13815259917','addr'=>'苏州市吴中区港龙财智广场4栋1309'],
['company'=>'苏州中润房地产经纪有限公司','name'=>    '邹亮亮','phone'=> '18551581537','addr'=>'苏州市吴中区甪直镇甪昆路北4号楼1室'],
['company'=>'昆山山大不动产咨询有限公司','name'=>    '熊明霞','phone'=> '13405224100','addr'=>'柏庐南路1150号'],
['company'=>'苏州汇福聚房地产经纪有限公司','name'=>   '俞月友','phone'=> '17768035980','addr'=>'苏州工业园区娄葑东延路116号1幢136室'],
['company'=>'苏州海潮房地产营销策划有限公司','name'=>  '龚启阳','phone'=> '13776069621','addr'=>'苏州市吴中区郭巷街道东安路505号2078室'],
['company'=>'苏州工业园区馨意庭房产咨询有限公司','name'=>    '顾祥金','phone'=> '13862578782','addr'=>'苏州工业园区苏胜路801号丽舍51幢103室'],
['company'=>'苏州昆仑房地产经纪有限公司','name'=>    '周昆伦','phone'=> '18651115666','addr'=>'苏州市高新区恒达清水园15幢109室'],
['company'=>'苏州房又多房地产经纪有限公司','name'=>   '陈吴兵','phone'=> '15895411441','addr'=>'苏州工业园区唯亭跨南路2号大丰收商业广场1幢302室'],
['company'=>'苏州家得顺房地产投资咨询有限公司','name'=> '史晓亮','phone'=> '15862513038','addr'=>'苏州工业园区唯亭金陵西路168号1幢134室'],
['company'=>'苏州鼎尊房地产经纪有限公司','name'=>    '郭伟','phone'=>  '15850829323','addr'=>'苏州市吴中区郭巷街道东安路5050号3062室'],
['company'=>'苏州房易联网络科技有限公司','name'=>    '韩丽华','phone'=> '18962155169','addr'=>'苏州市解放东路555号桐泾商务广场2幢901室'],
['company'=>'苏州链屋房地产经纪有限公司','name'=>    '高小燕','phone'=> '13962527729','addr'=>'苏州市南环西路润达新村33-1号'],
['company'=>'姑苏区沧浪开心窝房产中介服务中心','name'=> '周鹏','phone'=>  '18115495086','addr'=>'苏州市吴中西路866号'],
['company'=>'苏州筱屋房产经纪有限公司','name'=> '黄志娟','phone'=> '13962109346','addr'=>'苏州工业园区唯亭唯华路2号和泰都市生活广场2幢220室'],
['company'=>'昆山坤泽房地产咨询有限公司','name'=>    '史东坤','phone'=> '15150342463','addr'=>'昆山开发区世贸蝴蝶湾花园一期商业区7号楼19室'],
['company'=>'苏州格瑞房地产经纪有限公司','name'=>    '陆嵩','phone'=>  '18013543849','addr'=>'苏州工业园区南山巴黎印象46幢103室'],
['company'=>'苏州市德泰房地产营销策划有限公司','name'=> '钟凯','phone'=>  '15370019605','addr'=>'苏州工业园区苏雅路388号新天翔商业广场2幢1188室'],
['company'=>'昆山市千灯镇居之和房产中介所','name'=>   '王红波','phone'=> '13913285687','addr'=>'千灯镇人和路203号'],
['company'=>'苏州瑞福房地产经纪有限公司','name'=>    '杨徐','phone'=>  '15962208226','addr'=>'苏州工业园区旺墩路269号星座商务广场1幢805室'],
['company'=>'苏州苏城亿安不动产经纪有限公司','name'=>  '安玉华','phone'=> '18021278589','addr'=>'苏州工业园区金鸡湖路128号加城大厦9号D室B10'],
['company'=>'苏州工业园区大运置家房地产经纪有限公司','name'=>  '陈海松','phone'=> '13812778807','addr'=>'苏州工业园区海悦花园一区5幢103室'],
['company'=>'苏州创轩房地产经纪有限公司','name'=>    '李亮','phone'=>  '18913166288','addr'=>'苏州工业园区顺达商业广场1幢515室'],
['company'=>'苏州晟蓝房地产营销策划有限公司','name'=>  '张军','phone'=>  '18013140707','addr'=>'苏州市吴中区木渎镇珠江南路999号3幢A505-1室'],
['company'=>'苏州煜辉房地产经纪有限公司','name'=>    '周志年','phone'=> '13771867630','addr'=>'苏州市高新区佳林花苑58幢01室'],
['company'=>'苏州房管家房产经纪有限公司','name'=>    '朱情','phone'=>  '13222283996','addr'=>'苏州高新区恒达清水园15幢107室'],
['company'=>'苏州金黄埔房产经纪有限公司','name'=>    '欧阳德德','phone'=>    '18862103062','addr'=>'苏州高新区何山路99-11号'],
['company'=>'吴中经济技术开发区顺福源房产中介服务部','name'=>  '何蕓缤','phone'=> '18915539695','addr'=>'苏州吴中经济技术开发区天灵路137号'],
['company'=>'苏州圆家梦房地产经纪有限公司','name'=>   '王美玉','phone'=> '18913186012','addr'=>'苏州工业园区唯亭唯华路2号和泰都市生活广场2幢220室'],
['company'=>'苏州新天伦房地产经纪有限公司','name'=>   '宋伟祥','phone'=> '18006217395','addr'=>'苏州市吴中区盘蠡路129号'],
['company'=>'苏州市吴中区长桥关大姐房产信息咨询服务部','name'=> '关桂荣','phone'=> '18251161383','addr'=>'苏州市吴中区月浜一村21幢3号店面'],
['company'=>'吴中经济技术开发区久久房产信息咨询服务部','name'=> '赵海山','phone'=> '13348016365','addr'=>'苏州吴中经济技术开发区玫瑰久久花园25幢101号'],
['company'=>'苏州玛雅房地产经纪有限公司','name'=>    '刘军','phone'=>  '18551588844','addr'=>'苏州高新区滨河路1388号'],
['company'=>'苏州市新时代房屋经纪有限公司','name'=>   '樊荣芳','phone'=> '15806201949','addr'=>'苏州市吴中区胥口镇东胥香园75幢3号'],
['company'=>'苏州平顺吉房地产经纪有限公司','name'=>   '魏猛','phone'=>  '18118168098','addr'=>'苏州市金阊区三元二村70幢101室'],
['company'=>'苏州永真房地产经纪有限公司','name'=>    '张建房','phone'=> '15050151052','addr'=>'苏州高新区阳光假日新苑48幢109室'],
['company'=>'苏州亿家人房地产经纪有限公司','name'=>   '李忠诚','phone'=> '15150112267','addr'=>'苏州市吴中区澄湖路110号'],
['company'=>'苏州金亿家房地产经纪有限公司','name'=>   '胡彬','phone'=>  '15962192348','addr'=>'苏州高新区御花园购物广场G126室'],
['company'=>'苏州懿思园投资管理有限公司','name'=>    '李想','phone'=>  '15995587222','addr'=>'苏州市吴中区木渎镇竹园西路788号3幢10号'],
['company'=>'苏州胜辉不动产经纪有限公司','name'=>    '余磊','phone'=>  '13771865091','addr'=>'苏州高新区何山花园16幢商业房5'],
['company'=>'苏州工业园区正丰房产经纪有限公司','name'=> '陈太华','phone'=> '18115506814','addr'=>'苏州工业园区星湖街818号星湖名轩花园101-128幢120室'],
['company'=>'苏州龙之梦房产经纪有限公司','name'=>    '徐新佳','phone'=> '15995850775','addr'=>'苏州吴中经济开发区南溪苑37幢102室'],
['company'=>'苏州禧年房地产经纪有限公司','name'=>    '陈秀银','phone'=> '15862461884','addr'=>'苏州高新区新升新苑新苑三路商业房11号'],
['company'=>'苏州雅致居房地产营销策划有限公司','name'=> '李赛','phone'=>  '15851411327','addr'=>'苏州工业园区天域花园11商幢003室'],
['company'=>'苏州雅睿安房地产经纪有限公司','name'=>   '郑志红','phone'=> '15995878718','addr'=>'苏州市高新区世纪花园世纪一路37号'],
['company'=>'苏州伟吉房地产经纪有限公司','name'=>    '黄飞龙','phone'=> '13812641767','addr'=>'苏州高新区阳光假日新苑63幢107室'],
['company'=>'苏州长远房地产经纪有限公司','name'=>    '秦可','phone'=>  '13862419341','addr'=>'苏州高新区狮山新苑61幢7号'],
['company'=>'嘉兴鑫房盟房产营销策划有限公司','name'=>  '叶长青','phone'=> '18916529909','addr'=>'浙江省嘉兴市南湖区东栅经纪园区纺工路与纬一路口1幢130室'],
['company'=>'苏州铭城屋房产经纪有限公司','name'=>    '赵慧慧','phone'=> '13451736599','addr'=>'苏州工业园区顺达商业广场1幢639室'],
['company'=>'苏州金硕营销策划有限公司','name'=> '吕凤池','phone'=> '13812608438','addr'=>'苏州工业园区唯亭唯华路2号和泰都市生活广场1幢823室'],
['company'=>'苏州开创房产经纪有限公司','name'=> '班静之','phone'=> '15962260756','addr'=>'苏州市吴中区木渎镇金枫南路9号4幢105室'],
['company'=>'苏州家事达房地产经纪有限公司','name'=>   '朱国辉','phone'=> '13814864635','addr'=>'苏州市白塔西路76-1号'],
['company'=>'苏州美度不动产经纪有限公司','name'=>    '袁宏亮','phone'=> '15006214276','addr'=>'苏州高新区滨河路1551号'],
['company'=>'苏州工业园区仲联房地产经纪有限公司','name'=>    '杨加全','phone'=> '13771770660','addr'=>'苏州工业园区新城大厦B-324室'],
['company'=>'苏州锦安房地产经纪有限公司','name'=>    '童玮','phone'=>  '18625002315','addr'=>'苏州高新区御花园购物广场6108'],
['company'=>'苏州左邻右舍不动产经纪有限公司','name'=>  '吴勋','phone'=>  '18505120872','addr'=>'苏州工业园区方洲路611号4幢105室'],
['company'=>'苏州驰宇房产经纪有限公司','name'=> '陈兵','phone'=>  '13912776082','addr'=>'苏州市吴中区木渎镇金山路180-3号'],
['company'=>'苏州博裕房地产经纪有限公司','name'=>    '王双艳','phone'=> '18906136001','addr'=>'苏州市虎殿路1888号220室'],
['company'=>'昆山天顺房地产咨询有限公司朝阳店','name'=> '吴井艳','phone'=> '18012654615','addr'=>'昆山市玉山镇朝阳新村76号楼北3室'],
['company'=>'苏州泛海房产经纪有限公司','name'=> '杨浩','phone'=>  '18151571515','addr'=>'苏州市相城区元和街道善济路158号峰汇商务广场4幢119室'],
['company'=>'苏州安润房地产经纪有限公司','name'=>    '徐淑英','phone'=> '15895569428','addr'=>'苏州市平江区日规路18-3号'],
['company'=>'苏州市好帮手房产中介有限公司','name'=>   '田华','phone'=>  '13812610187','addr'=>'苏州市东环新村36幢105室'],
['company'=>'苏州千万间房产经纪有限公司','name'=>    '刘明钊','phone'=> '15298889355','addr'=>'苏州相城经济开发区泰元路308号'],
['company'=>'苏州中地不动产信息咨询有限公司','name'=>  '朱雪娥','phone'=> '18915404400','addr'=>'苏州高新区新升新苑新升路商业房5号'],
['company'=>'苏州昊信房地产营销策划有限公司','name'=>  '刘浩义','phone'=> '15062416230','addr'=>'苏州市中街路169号403室'],
['company'=>'苏州梦想之家房地产经纪有限公司','name'=>  '吴健敏','phone'=> '18013132303','addr'=>'苏州吴中经济开发区城南街道金珺花园12幢107室'],
['company'=>'苏州易邦房产经纪有限公司','name'=> '程修善','phone'=> '13962189123','addr'=>'苏州吴中经济开发区城南街道金珺花园135幢C110号'],
['company'=>'苏州麦丰房地产经纪有限公司','name'=>    '王志成','phone'=> '18136178508','addr'=>'苏州市相城区元和街道齐门北大街1245号'],
['company'=>'苏州名古屋房地产经纪有限公司','name'=>   '程思想','phone'=> '15895565927','addr'=>'苏州高新区塔园路220号'],
['company'=>'苏州融义信房产经纪有限公司','name'=>    '王德强','phone'=> '18251115550','addr'=>'苏州相城经济开发区漕湖产业园瑜翠花园3幢商业9'],
['company'=>'苏州蓝岸房地产投资咨询有限公司','name'=>  '何琳','phone'=>  '18751191647','addr'=>'苏州市吴中区郭巷街道郭新西路116号'],
['company'=>'苏州佰嘉星房地产营销策划有限公司','name'=> '周春艳','phone'=> '13584832241','addr'=>'苏州市石灰中弄39-1号'],
['company'=>'苏州正光房产经纪有限公司','name'=> '马于梅','phone'=> '18915534135','addr'=>'苏州工业园区唯亭唯华路2号和泰都市生活广场1幢142室'],
['company'=>'苏州吴中经济开发区我有我家房产信息咨询服务部','name'=>   '左高翔','phone'=> '17751435307','addr'=>'苏州吴中经济开发区白云街76号'],
['company'=>'苏州市相城区黄埭镇保利房产信息服务部','name'=>   '范宏伟','phone'=> '13004585338','addr'=>'苏州市相城区黄埭镇中市路40号'],
['company'=>'苏州卫谓房地产营销策划有限公司','name'=>  '黄爱金','phone'=> '18914045397','addr'=>'苏州市盘溪新村农贸市场477室商用房'], 
['company'=>'苏州工业园区恒安房地产经纪有限公司','name'=>    '蔡虹','phone'=>  '15606217206','addr'=>'苏州工业园区中天湖畔生活广场1幢223室'],
['company'=>'苏州弘高房地产投资咨询有限公司','name'=>  '冯雷','phone'=>  '13196605888','addr'=>'苏州工业园区东沙湖路111号时代上城花园一区38幢'],
['company'=>'姑苏区蜂密园房屋信息咨询服务部','name'=>  '曹金华','phone'=> '13771959838','addr'=>'苏州市竹辉路410号'],
['company'=>'苏州一斗文房产经纪有限公司','name'=>    '马来安','phone'=> '18118102069','addr'=>'苏州吴中经济开发区城南街道邵昂路69号3幢712号'],
['company'=>'苏州源浩房地产经纪有限公司','name'=>    '张良春','phone'=> '15370070732','addr'=>'苏州市相城区元和街道人民路4555号繁花中心写字楼A楼西座（6幢918）'],
['company'=>'昆山易仙居房产咨询有限公司','name'=>    '唐平元','phone'=> '13913288233','addr'=>'花桥镇绿地大道258号-1-1-317室'],
['company'=>'苏州安亿家房产经纪有限公司','name'=>    '王会','phone'=>  '15851445994','addr'=>'苏州市吴中区木渎镇长江路98号57幢526号'],
['company'=>'吴中区城区顺和房产服务部','name'=> '胥双洋','phone'=> '15995705505','addr'=>'苏州市吴中区长桥街道鑫悦生活广场2幢128室'],
['company'=>'苏州嘉佑房地产经纪有限公司','name'=>    '孙恒友','phone'=> '18362761463','addr'=>'苏州工业园区凇江路266号橄榄湾花园13幢212室'],
['company'=>'王东平（个人）','name'=>  '王东平','phone'=> '18626116863','addr'=>'特殊'],
['company'=>'苏州美臣投资顾问有限公司','name'=> '黄伟','phone'=>  '13906200855','addr'=>'苏州工业园区方洲路599号5幢111室'],
['company'=>'苏州吉满堂房地产经纪有限公司','name'=>   '王恩国','phone'=> '13451615958','addr'=>'苏州工业园区贵都大厦1幢1A5A6'],
['company'=>'苏州工业园区苏家坊商务信息咨询服务部','name'=>   '周利勤','phone'=> '18626295565','addr'=>'苏州工业园区胜浦嘉馨苑2幢103室'],
['company'=>'苏州爱尚雅居房地产经纪有限公司','name'=>  '陈晨','phone'=>  '13402678993','addr'=>'苏州工业园区东环路1500号现代创展大厦1幢1608室'],
['company'=>'苏州本汇房产经纪有限公司','name'=> '宋晓扬','phone'=> '13776087876','addr'=>'苏州庭园路190号'],
['company'=>'苏州鸿城行地产综合服务有限公司','name'=>  '顾勇敏','phone'=> '15950060918','addr'=>'苏州高新区新浒商业城1幢606室'],
['company'=>'苏州鼎海房产信息有限公司','name'=> '于红梅','phone'=> '13656208088','addr'=>'苏州市吴中区天灵路68号'],
['company'=>'吴中经济技术开发区越溪好佳佳房产中介服务部','name'=>    '殷马林','phone'=> '15850100385','addr'=>'苏州吴中经济开发区越溪街道越溪原筑16幢105室'],
['company'=>'苏州天居房产经纪有限公司','name'=> '蔡勇','phone'=>  '18550197161','addr'=>'苏州市吴中区澄湖西路888号恒润国际商务广场B栋1505'],
['company'=>'苏州雅墅房产经纪有限公司','name'=> '韩明明','phone'=> '13732620633','addr'=>'苏州工业园区方洲路533号1幢102室'],
['company'=>'苏州齐创房产经纪有限公司','name'=> '仝泽明','phone'=> '13913176490','addr'=>'吴江区松陵镇高新路邻里中心12幢620室'],
['company'=>'苏州世乐居不动产经纪有限公司','name'=>   '徐军','phone'=>  '15850203377','addr'=>'苏州市人民路3188号19幢901室'],
['company'=>'苏州乾城房地产经纪有限公司','name'=>    '陈拓','phone'=>  '15850093152','addr'=>'苏州工业园区唯亭金陵西路168号1幢132室'],
['company'=>'苏州启阳房地产营销策划有限公司','name'=>  '谢斌','phone'=>  '18260108182','addr'=>'苏州吴中经济开发区城南街道迎春南路112号3幢1706室'],
['company'=>'苏州市吴中区甪直淞泽房产中介咨询服务部','name'=>  '高苏根','phone'=> '13913117140','addr'=>'苏州市吴中区甪直镇车坊仁德村五组'],
['company'=>'苏州市吴中区郭巷有创商务信息咨询服务部','name'=>  '刘红霞','phone'=> '13913551104','addr'=>'苏州市吴中区郭巷街道通达路1555号21幢111室'],
['company'=>'苏州品合房产经纪有限公司','name'=> '梅书剑','phone'=> '17601574566','addr'=>'苏州市吴中区郭巷街道东安路505号2064室'],
['company'=>'苏州市正发房产经纪有限公司','name'=>    '梁露芹','phone'=> '13451568346','addr'=>'苏州工业园区城邦花园36商幢101室'],
['company'=>'苏州思廷房地产经纪有限公司','name'=>    '张苏北','phone'=> '15651112878','addr'=>'苏州市木渎镇长江路98号57幢1118号'],
['company'=>'苏州金佛营销策划有限公司','name'=> '焦玉朋','phone'=> '18550526642','addr'=>'苏州市吴中区木渎镇玉山路金枫广告设计产业园2号楼2309室'],
['company'=>'苏州家铭房产经纪有限公司','name'=> '闫燕燕','phone'=> '18912628666','addr'=>'苏州工业园区唯华路都市VIP1幢101室'],
['company'=>'苏州铭拓房产经纪有限公司','name'=> '王磊','phone'=>  '18136070708','addr'=>'苏州工业园区唯亭唯华路2号和泰都市生活广场1幢918室'],
['company'=>'苏州华义苏城房地产经纪有限公司','name'=>  '蔡巍巍','phone'=> '18151078000','addr'=>'苏州市吴中区木渎镇金枫南路1998号'],
['company'=>'吴中区郭巷乐家房产信息咨询服务部','name'=> '殷鹏','phone'=>  '18051214180','addr'=>'苏州市吴中区郭巷街道东安路505号2028室'],
['company'=>'苏州耀博房地产营销策划有限公司','name'=>  '盛国庆','phone'=> '15371865575','addr'=>'苏州市吴中区郭巷街道东安路505号2046室'],
['company'=>'苏州名古爱居房产经纪有限公司','name'=>   '顾晨华','phone'=> '13771850356','addr'=>'苏州市吴中区郭巷街道通畅路8号A栋三楼'],
['company'=>'苏州策良房产经纪有限公司','name'=> '贺常华','phone'=> '13814838489','addr'=>'苏州工业园区唯亭金陵西路288号1幢217室'],
['company'=>'苏州桃花源网络科技有限公司','name'=>    '吕桂贤','phone'=> '18112523951','addr'=>'苏州吴中经济开发区玫瑰久久花园14幢103室'],
['company'=>'苏州盼家地产营销策划有限公司','name'=>   '于佳','phone'=>  '18120051818','addr'=>'苏州工业园区万盛街28号星海国际大厦1118室'],
['company'=>'苏州云锦房产经纪有限公司','name'=> '刘晓健','phone'=> '15606203732','addr'=>'苏州市高新区浒关分区金灯街28号'],
['company'=>'苏州好房通房地产经纪有限公司','name'=>   '仲凤娇','phone'=> '15050477954','addr'=>'苏州吴中经济开发区郭巷街道双银国际金融城8幢512号'],
['company'=>'苏州润田地产经纪有限公司','name'=> '言建锋','phone'=> '13815253663','addr'=>'苏州工业园区自由水岸花园17商幢102室'],
['company'=>'苏州正泰合房地产经纪有限公司','name'=>   '王世军','phone'=> '13915589939','addr'=>'苏州市吴中西路830号'],
['company'=>'苏州房益达房产代理有限公司','name'=>    '金柯桥','phone'=> '15250061050','addr'=>'苏州市吴中区长桥街道财智商务广场1幢1115号'],
['company'=>'苏州芙庭房产经纪有限公司','name'=> '杜成成','phone'=> '18306207971','addr'=>'苏州市相城区渭塘镇城阳路2568号'],
['company'=>'苏州鸿基伟业不动产经纪有限公司','name'=>  '于晶晶','phone'=> '15850083318','addr'=>'苏州市平江区永林新村65幢1-12室'],
['company'=>'苏州爱爱佳房产经纪有限公司','name'=>    '皇甫秋芳','phone'=>    '18896543548','addr'=>'苏州工业园区唯亭唯华路2号和泰都市生活广场2幢421室'],
['company'=>'苏州天策投资顾问有限公司','name'=> '吴超','phone'=>  '18896722251','addr'=>'苏州高新区壶关分区兴贤路33号101室'],
['company'=>'苏州德邻地产管理咨询有限公司','name'=>   '周顺','phone'=>  '18006212661','addr'=>'苏州工业园区苏雅路388号新天翔商业广场2幢1001室'],
['company'=>'苏州雅润房产经纪有限公司','name'=> '孙雅贤','phone'=> '18550006033','addr'=>'苏州吴中经济开发区郭巷街道叠翠峰花园2幢122室'],
['company'=>'苏州盈源房产经纪有限公司','name'=> '吴晶','phone'=>  '18662159288','addr'=>'苏州工业园区星海街188号1幢1217室'],
['company'=>'苏州工业园区东凯房产经纪有限公司','name'=> '周晓栋','phone'=> '18550460725','addr'=>'苏州工业园区加城花园22幢003商铺'],
['company'=>'苏州捷博房产经纪有限公司','name'=> '孟贤','phone'=>  '13771954394','addr'=>'苏州工业园区加城花园22幢002室'],
['company'=>'苏州百景房产经纪有限公司','name'=> '陈李军','phone'=> '18036398777','addr'=>'苏州工业园区星红路199号A305室'],
['company'=>'苏州亿嘉缘房地产经纪有限公司','name'=>   '顾小兰','phone'=> '15151425729','addr'=>'苏州工业园区新未来花园21幢510室'],
['company'=>'苏州市福润不动产经纪有限公司','name'=>   '顾华','phone'=>  '13606217120','addr'=>'苏州工业园区雅戈尔太阳城8幢108室'],
['company'=>'苏州缘庭房地产营销策划有限公司','name'=>  '李亚庭','phone'=> '13295188608','addr'=>'苏州工业园区娄葑镇星红路199号技改小区配套服务中心1号楼A406室'],
['company'=>'苏州市吴中区甪直天地房屋咨询服务部','name'=>    '陆建中','phone'=> '13962134378','addr'=>'苏州市吴中区甪直镇地园村62-6号'],
['company'=>'苏州辉创房产经纪有限公司','name'=> '方志杰','phone'=> '15850211581','addr'=>'苏州吴中经济开发区溪秀路798号'],
['company'=>'苏州尚品行房地产营销策划有限公司','name'=> '朱建英','phone'=> '18626283258','addr'=>'苏州市吴中区木渎镇金枫南路198号5幢3330室'],
['company'=>'金色家园网络科技有限公司','name'=> '李情','phone'=>  '18896992386','addr'=>'北京市东城区广渠家园8楼2层201室'],
['company'=>'苏州工业园区易居轩房产经纪有限公司','name'=>    '蒋化芝','phone'=> '13913116694','addr'=>'苏州工业园区淞江路218号蓝岸花园27幢207室'],
['company'=>'苏州工业园区胜浦满多佳商务信息咨询部','name'=>   '卢慧玉','phone'=> '15862379761','addr'=>'苏州工业园区胜浦新胜路366号6幢102室'],
['company'=>'昆山百兴居房产咨询有限公司','name'=>    '缪正洪','phone'=> '18914998668','addr'=>'昆山市张浦镇京东路514号'],
['company'=>'苏州千城居房产营销策划有限公司','name'=>  '钱苏生','phone'=> '15962267015','addr'=>'苏州市吴中区木渎镇长江路98号57幢835号'],
['company'=>'苏州云居客房产营销策划有限公司','name'=>  '武云飞','phone'=> '18550089958','addr'=>'苏州市吴中区木渎镇香溪西路12-4号'],
['company'=>'苏州宅安居房产经纪有限公司','name'=>    '李卫华','phone'=> '18251154555','addr'=>'苏州市吴中区郭巷街道国泰社区商业街12号'],
['company'=>'苏州鑫享世居房产经纪有限公司','name'=>   '陈燕妹','phone'=> '13626190264','addr'=>'苏州工业园区东沙湖路100号1幢138室'],
['company'=>'苏州志城房地产营销策划有限公司','name'=>  '陈冬俊','phone'=> '15150465182','addr'=>'苏州工业园区北榭雨街65号太阳星辰花园四区89幢103室'],
['company'=>'苏州阿尔法房产经纪有限公司','name'=>    '金光华','phone'=> '13338650367','addr'=>'苏州工业园区星港街268号中天湖畔广场一层131'],
['company'=>'苏州鸿洋房地产经纪有限公司','name'=>    '宋卓君','phone'=> '13862161285','addr'=>'苏州市皮市街286号'],
['company'=>'苏州安房多房地产策划有限公司','name'=>   '陈斌','phone'=>  '18951110029','addr'=>'苏州市姑苏区盘溪新村农贸市场（478室商用房）'],
['company'=>'苏州市云房源软件服务有限公司','name'=>   '刘珍','phone'=>  '13812607066','addr'=>'苏州市劳动路66号'],
['company'=>'苏州众美丽家房地产营销策划有限公司','name'=>    '周林旭','phone'=> '15150158605','addr'=>'苏州市干将西路515号（佳福大厦505室）'],
['company'=>'苏州腾隆行房地产营销策划有限公司','name'=> '周平','phone'=>  '18662152766','addr'=>'苏州高新区文昌路350号5幢1406室'],
['company'=>'苏州工业园区故乡驿站房地产经纪有限公司','name'=>  '吴勇','phone'=>  '13814815722','addr'=>'苏州工业园区海悦花园七区15商铺108室'],
['company'=>'苏州鸿福源房地产经纪有限公司','name'=>   '戴红巧','phone'=> '13913143535','addr'=>'苏州工业园区唯华路3号君地商务广场5幢1019室'],
['company'=>'苏州信易居房地产经纪有限公司','name'=>   '吕顺','phone'=>  '18860914624','addr'=>'苏州工业园区娄蔚星湖街999号99幢1302室'],
['company'=>'苏州范氏地产经纪有限公司','name'=> '范林生','phone'=> '15995412210','addr'=>'苏州工业园区莲花市场二楼11号'],
['company'=>'苏州鸿伟佳业房地产投资顾问有限公司','name'=>    '常红','phone'=>  '13913245694','addr'=>'苏州工业园区嘉瑞巷8号乐嘉大厦1幢1220室'],
['company'=>'苏州百斯顿房产经纪有限公司','name'=>    '张齐','phone'=>  '15851486937','addr'=>'苏州市相城区元和街道御寒路88号1幢128室'],
['company'=>'苏州乐好居不动产经纪有限公司','name'=>   '刘旭','phone'=>  '13914022364','addr'=>'苏州工业园区东湖林语14幢101室'],
['company'=>'苏州工业园区好吉屋房产经纪有限公司','name'=>    '杨东菊','phone'=> '15850180418','addr'=>'苏州工业园区南榭雨街9号凤凰新天地117A号'],
['company'=>'吴中经济开发区友佳房产信息咨询服务部','name'=>   '顾振雷','phone'=> '13913160475','addr'=>'苏州吴中经济开发区澄湖路70号'],
['company'=>'苏州联线房地产信息咨询有限公司','name'=>  '胡冰','phone'=>  '13162818959','addr'=>'苏州工业园区东环路1500号现代创展大厦1幢1502室'],
['company'=>'苏州兰庭房地产经纪有限公司','name'=>    '肖木利','phone'=> '15051508585','addr'=>'苏州工业园区苏华路8号中银惠龙大厦1幢2005室'],
['company'=>'苏州正立兴房地产营销策划有限公司','name'=> '占正刚','phone'=> '18551127015','addr'=>'吴江区松陵镇高新路938号12幢-319'],
['company'=>'苏州文元房产经纪有限公司','name'=> '吴文彬','phone'=> '13771855579','addr'=>'苏州市吴中区长桥街道鑫悦生活广场1幢1111号'],
['company'=>'苏州腾力房地产经纪有限公司','name'=>    '郭贞芳','phone'=> '18061928932','addr'=>'苏州市吴中西路653号（天辰花园）'],
['company'=>'苏州房宜家房产经纪有限公司','name'=>    '韩宇','phone'=>  '13771875141','addr'=>'苏州市永生路1号14幢101室'],
['company'=>'苏州鸿图房产经纪有限公司','name'=> '张建华','phone'=> '18552448888','addr'=>'吴江区松陵镇江兴路98、100号'],
['company'=>'苏州房励拓网络科技有限公司','name'=>    '叶敏敏','phone'=> '13912743455','addr'=>'吴江区松陵镇中山南路1729号上领大厦305室'],
['company'=>'苏州煜吉房地产经纪有限公司','name'=>    '李冬冬','phone'=> '13915584222','addr'=>'苏州市高新区阳光假日新苑49幢106室'],
['company'=>'苏州首创房地产经纪有限公司','name'=>    '范顺丹','phone'=> '13814588902','addr'=>'苏州市吴中区木渎镇珠江南路1083号1幢116号'],
['company'=>'吴江市富城房产中介服务部','name'=> '彭娟林','phone'=> '15862691518','addr'=>'吴江市松陵镇油车路130-2号店面'],];




foreach ($arr as $key => $value) {
    if(!$value['name'] || !$value['phone'] || !$value['company'] || strlen($value['phone'])!=11)
        continue;
    if(Yii::app()->db->createCommand("select id from user where phone='".$value['phone']."'")->queryScalar()) {
        continue;
    }
    $com = $value['company'];
    $user = new UserExt;
    $user->type = 2;
    $user->status = 1;
    $user->name = strlen($value['name']) <=1 ?($value['name'].'先生'):$value['name'];
    $user->phone = $value['phone'];
    if($cid = Yii::app()->db->createCommand("select id from company where name='".$value['company']."'")->queryScalar()) {
        $user->cid = $cid;
    } else {
        $company = new CompanyExt;
        $company->status = 1;
        $company->type = 2;
        $company->name = $value['company'];
        $company->address = $value['addr'];
        $company->save();
        $user->cid = $company->id;
    }
    $user->save();
    echo ($key+1).'/'.count($arr).'========================\n';
}
echo 'finished';
    }

    public function actionAddArea()
    {
        $city_arr = array('安徽'
            => array(
            '合肥(*)', '合肥',
            '安庆', '安庆',
            '蚌埠', '蚌埠',
            '亳州', '亳州',
            '巢湖', '巢湖',
            '滁州', '滁州',
            '阜阳', '阜阳',
            '贵池', '贵池',
            '淮北', '淮北',
            '淮化', '淮化',
            '淮南', '淮南',
            '黄山', '黄山',
            '九华山', '九华山',
            '六安', '六安',
            '马鞍山', '马鞍山',
            '宿州', '宿州',
            '铜陵', '铜陵',
            '屯溪', '屯溪',
            '芜湖', '芜湖',
            '宣城', '宣城'),
             
         '福建'
            => array(
            '福州(*)', '福州',
            '福安', '福安',
            '龙岩', '龙岩',
            '南平', '南平',
            '宁德', '宁德',
            '莆田', '莆田',
            '泉州', '泉州',
            '三明', '三明',
            '邵武', '邵武',
            '石狮', '石狮',
            '晋江', '晋江',
            '永安', '永安',
            '武夷山', '武夷山',
            '厦门', '厦门',
            '漳州', '漳州'),
              
         '甘肃'
            => array(
            '兰州(*)', '兰州',
            '白银', '白银',
            '定西', '定西',
            '敦煌', '敦煌',
            '甘南', '甘南',
            '金昌', '金昌',
            '酒泉', '酒泉',
            '临夏', '临夏',
            '平凉', '平凉',
            '天水', '天水',
            '武都', '武都',
            '武威', '武威',
            '西峰', '西峰',
            '嘉峪关','嘉峪关',
            '张掖', '张掖'),
             
         '广东'
            => array(
            '广州(*)', '广州',
            '潮阳', '潮阳',
            '潮州', '潮州',
            '澄海', '澄海',
            '东莞', '东莞',
            '佛山', '佛山',
            '河源', '河源',
            '惠州', '惠州',
            '江门', '江门',
            '揭阳', '揭阳',
            '开平', '开平',
            '茂名', '茂名',
            '梅州', '梅州',
            '清远', '清远',
            '汕头', '汕头',
            '汕尾', '汕尾',
            '韶关', '韶关',
            '深圳', '深圳',
            '顺德', '顺德',
            '阳江', '阳江',
            '英德', '英德',
            '云浮', '云浮',
            '增城', '增城',
            '湛江', '湛江',
            '肇庆', '肇庆',
            '中山', '中山',
            '珠海', '珠海'),
             
         '广西'
            => array(
            '南宁(*)', '南宁',
            '百色', '百色',
            '北海', '北海',
            '桂林', '桂林',
            '防城港', '防城港',
            '河池', '河池',
            '贺州', '贺州',
            '柳州', '柳州',
            '来宾', '来宾',
            '钦州', '钦州',
            '梧州', '梧州',
            '贵港', '贵港',
            '玉林', '玉林'),
             
         '贵州'
            => array(
            '贵阳(*)', '贵阳',
            '安顺', '安顺',
            '毕节', '毕节',
            '都匀', '都匀',
            '凯里', '凯里',
            '六盘水', '六盘水',
            '铜仁', '铜仁',
            '兴义', '兴义',
            '玉屏', '玉屏',
            '遵义', '遵义'),
             
         '海南'
            => array(
            '海口(*)', '海口',
    '三亚', '三亚',
    '五指山', '五指山',
    '琼海', '琼海',
    '儋州', '儋州',
    '文昌', '文昌',
    '万宁', '万宁',
    '东方', '东方',
    '定安', '定安',
    '屯昌', '屯昌',
    '澄迈', '澄迈',
    '临高', '临高',
    '万宁', '万宁',
    '白沙黎族', '白沙黎族',
    '昌江黎族', '昌江黎族',
    '乐东黎族', '乐东黎族',
    '陵水黎族', '陵水黎族',
    '保亭黎族', '保亭黎族',
    '琼中黎族', '琼中黎族',
    '西沙群岛', '西沙群岛',
    '南沙群岛', '南沙群岛',
    '中沙群岛', '中沙群岛'
            ),
             
         '河北'
            => array(
            '石家庄(*)', '石家庄',
            '保定', '保定',
            '北戴河', '北戴河',
            '沧州', '沧州',
            '承德', '承德',
            '丰润', '丰润',
            '邯郸', '邯郸',
            '衡水', '衡水',
            '廊坊', '廊坊',
            '南戴河', '南戴河',
            '秦皇岛', '秦皇岛',
            '唐山', '唐山',
            '新城', '新城',
            '邢台', '邢台',
            '张家口', '张家口'),
             
         '黑龙江'
            => array(
            '哈尔滨(*)', '哈尔滨',
            '北安', '北安',
            '大庆', '大庆',
            '大兴安岭', '大兴安岭',
            '鹤岗', '鹤岗',
            '黑河', '黑河',
            '佳木斯', '佳木斯',
            '鸡西', '鸡西',
            '牡丹江', '牡丹江',
            '齐齐哈尔', '齐齐哈尔',
            '七台河', '七台河',
            '双鸭山', '双鸭山',
            '绥化', '绥化',
            '伊春', '伊春'),
             
         '河南'
            => array(
            '郑州(*)', '郑州',
            '安阳', '安阳',
            '鹤壁', '鹤壁',
            '潢川', '潢川',
            '焦作', '焦作',
            '济源', '济源',
            '开封', '开封',
            '漯河', '漯河',
            '洛阳', '洛阳',
            '南阳', '南阳',
            '平顶山', '平顶山',
            '濮阳', '濮阳',
            '三门峡', '三门峡',
            '商丘', '商丘',
            '新乡', '新乡',
            '信阳', '信阳',
            '许昌', '许昌',
            '周口', '周口',
            '驻马店', '驻马店'),
             
         '香港'
            => array(
            '香港', '香港',
            '九龙', '九龙',
            '新界', '新界'),
             
         '湖北'
            => array(
            '武汉(*)', '武汉',
            '恩施', '恩施',
            '鄂州', '鄂州',
            '黄冈', '黄冈',
            '黄石', '黄石',
            '荆门', '荆门',
            '荆州', '荆州',
            '潜江', '潜江',
            '十堰', '十堰',
            '随州', '随州',
            '武穴', '武穴',
            '仙桃', '仙桃',
            '咸宁', '咸宁',
            '襄阳', '襄阳',
            '襄樊', '襄樊',
            '孝感', '孝感',
            '宜昌', '宜昌'),
             
         '湖南'
            => array(
            '长沙(*)', '长沙',
            '常德', '常德',
            '郴州', '郴州',
            '衡阳', '衡阳',
            '怀化', '怀化',
            '吉首', '吉首',
            '娄底', '娄底',
            '邵阳', '邵阳',
            '湘潭', '湘潭',
            '益阳', '益阳',
            '岳阳', '岳阳',
            '永州', '永州',
            '张家界', '张家界',
            '株洲', '株洲'),
             
         '江苏'
            => array(
            '南京(*)', '南京',
            '常熟', '常熟',
            '常州', '常州',
            '海门', '海门',
            '淮安', '淮安',
            '江都', '江都',
            '江阴', '江阴',
            '昆山', '昆山',
            '连云港', '连云港',
            '南通', '南通',
            '启东', '启东',
            '沭阳', '沭阳',
            '宿迁', '宿迁',
            '苏州', '苏州',
            '太仓', '太仓',
            '泰州', '泰州',
            '同里', '同里',
            '无锡', '无锡',
            '徐州', '徐州',
            '盐城', '盐城',
            '扬州', '扬州',
            '宜兴', '宜兴',
            '仪征', '仪征',
            '张家港', '张家港',
            '镇江', '镇江',
            '周庄', '周庄'),
             
         '江西'
            => array(
            '南昌(*)', '南昌',
            '抚州', '抚州',
            '赣州', '赣州',
            '吉安', '吉安',
            '景德镇', '景德镇',
            '井冈山', '井冈山',
            '九江', '九江',
            '庐山', '庐山',
            '萍乡', '萍乡',
            '上饶', '上饶',
            '新余', '新余',
            '宜春', '宜春',
            '鹰潭', '鹰潭'),
             
         '吉林'
            => array(
            '长春(*)', '长春',
            '白城', '白城',
            '白山', '白山',
            '珲春', '珲春',
            '辽源', '辽源',
            '梅河', '梅河',
            '吉林', '吉林',
            '四平', '四平',
            '松原', '松原',
            '通化', '通化',
            '延吉', '延吉'),
         '辽宁'
            => array(
            '沈阳(*)', '沈阳',
            '鞍山', '鞍山',
            '本溪', '本溪',
            '朝阳', '朝阳',
            '大连', '大连',
            '丹东', '丹东',
            '抚顺', '抚顺',
            '阜新', '阜新',
            '葫芦岛', '葫芦岛',
            '锦州', '锦州',
            '辽阳', '辽阳',
            '盘锦', '盘锦',
            '铁岭', '铁岭',
            '营口', '营口'),
             
         '澳门'
            => array(
            '澳门', '澳门'),
             
         '内蒙古'
            => array(
            '呼和浩特(*)', '呼和浩特',
            '阿拉善盟', '阿拉善盟',
            '包头', '包头',
            '赤峰', '赤峰',
            '东胜', '东胜',
            '海拉尔', '海拉尔',
            '集宁', '集宁',
            '临河', '临河',
            '通辽', '通辽',
            '乌海', '乌海',
            '乌兰浩特', '乌兰浩特',
            '锡林浩特', '锡林浩特'),
             
         '宁夏'
            => array(
            '银川(*)', '银川',
            '固原', '固原',
            '中卫', '中卫',
            '石嘴山', '石嘴山',
            '吴忠', '吴忠'),
             
         '青海'
            => array(
            '西宁(*)', '西宁',
            '德令哈', '德令哈',
            '格尔木', '格尔木',
            '共和', '共和',
            '海东', '海东',
            '海晏', '海晏',
            '玛沁', '玛沁',
            '同仁', '同仁',
            '玉树', '玉树'),
             
         '山东'
            => array(
            '济南(*)', '济南',
            '滨州', '滨州',
            '兖州', '兖州',
            '德州', '德州',
            '东营', '东营',
            '菏泽', '菏泽',
            '济宁', '济宁',
            '莱芜', '莱芜',
            '聊城', '聊城',
            '临沂', '临沂',
            '蓬莱', '蓬莱',
            '青岛', '青岛',
            '曲阜', '曲阜',
            '日照', '日照',
            '泰安', '泰安',
            '潍坊', '潍坊',
            '威海', '威海',
            '烟台', '烟台',
            '枣庄', '枣庄',
            '淄博', '淄博'),
             
             
         '山西'
            => array(
            '太原(*)', '太原',
            '长治', '长治',
            '大同', '大同',
            '候马', '候马',
            '晋城', '晋城',
            '离石', '离石',
            '临汾', '临汾',
            '宁武', '宁武',
            '朔州', '朔州',
            '忻州', '忻州',
            '阳泉', '阳泉',
            '榆次', '榆次',
            '运城', '运城'),
             
         '陕西'
            => array(
            '西安(*)', '西安',
            '安康', '安康',
            '宝鸡', '宝鸡',
            '汉中', '汉中',
            '渭南', '渭南',
            '商州', '商州',
            '绥德', '绥德',
            '铜川', '铜川',
            '咸阳', '咸阳',
            '延安', '延安',
            '榆林', '榆林'),
             
         '四川'
            => array(
            '成都(*)', '成都',
            '巴中', '巴中',
            '达州', '达州',
            '德阳', '德阳',
            '都江堰', '都江堰',
            '峨眉山', '峨眉山',
            '涪陵', '涪陵',
            '广安', '广安',
            '广元', '广元',
            '九寨沟', '九寨沟',
            '康定', '康定',
            '乐山', '乐山',
            '泸州', '泸州',
            '马尔康', '马尔康',
            '绵阳', '绵阳',
            '眉山', '眉山',
            '南充', '南充',
            '内江', '内江',
            '攀枝花', '攀枝花',
            '遂宁', '遂宁',
            '汶川', '汶川',
            '西昌', '西昌',
            '雅安', '雅安',
            '宜宾', '宜宾',
            '自贡', '自贡',
            '资阳', '资阳'),
             
         '台湾'
            => array(
            '台北(*)', '台北',
            '基隆', '基隆',
            '台南', '台南',
            '台中', '台中',
            '高雄', '高雄',
            '屏东', '屏东',
            '南投', '南投',
            '云林', '云林',
            '新竹', '新竹',
            '彰化', '彰化',
            '苗栗', '苗栗',
            '嘉义', '嘉义',
            '花莲', '花莲',
            '桃园', '桃园',
            '宜兰', '宜兰',
            '台东', '台东',
            '金门', '金门',
            '马祖', '马祖',
            '澎湖', '澎湖',
            '其它', '其它'),
             
         '天津'
            => array(
            '天津', '天津',
            '和平', '和平',
            '东丽', '东丽',
            '河东', '河东',
            '西青', '西青',
            '河西', '河西',
            '津南', '津南',
            '南开', '南开',
            '北辰', '北辰',
            '河北', '河北',
            '武清', '武清',
            '红挢', '红挢',
            '塘沽', '塘沽',
            '汉沽', '汉沽',
            '大港', '大港',
            '宁河', '宁河',
            '静海', '静海',
            '宝坻', '宝坻',
            '蓟县', '蓟县' ),
             
         '新疆'
            => array(
            '乌鲁木齐(*)', '乌鲁木齐',
            '阿克苏', '阿克苏',
            '阿勒泰', '阿勒泰',
            '阿图什', '阿图什',
            '博乐', '博乐',
            '昌吉', '昌吉',
            '东山', '东山',
            '哈密', '哈密',
            '和田', '和田',
            '喀什', '喀什',
            '克拉玛依', '克拉玛依',
            '库车', '库车',
            '库尔勒', '库尔勒',
            '奎屯', '奎屯',
            '石河子', '石河子',
            '塔城', '塔城',
            '吐鲁番', '吐鲁番',
            '伊宁', '伊宁'),
             
         '西藏'
            => array(
            '拉萨(*)', '拉萨',
            '阿里', '阿里',
            '昌都', '昌都',
            '林芝', '林芝',
            '那曲', '那曲',
            '日喀则', '日喀则',
            '山南', '山南'),
             
         '云南'
            => array(
            '昆明(*)', '昆明',
            '大理', '大理',
            '保山', '保山',
            '楚雄', '楚雄',
            '大理', '大理',
            '东川', '东川',
            '个旧', '个旧',
            '景洪', '景洪',
            '开远', '开远',
            '临沧', '临沧',
            '丽江', '丽江',
            '六库', '六库',
            '潞西', '潞西',
            '曲靖', '曲靖',
            '思茅', '思茅',
            '文山', '文山',
            '西双版纳', '西双版纳',
            '玉溪', '玉溪',
            '中甸', '中甸',
            '昭通', '昭通'),
             
         '浙江'
            => array(
            '杭州(*)', '杭州',
            '安吉', '安吉',
            '慈溪', '慈溪',
            '定海', '定海',
            '奉化', '奉化',
            '海盐', '海盐',
            '黄岩', '黄岩',
            '湖州', '湖州',
            '嘉兴', '嘉兴',
            '金华', '金华',
            '临安', '临安',
            '临海', '临海',
            '丽水', '丽水',
            '宁波', '宁波',
            '瓯海', '瓯海',
            '平湖', '平湖',
            '千岛湖', '千岛湖',
            '衢州', '衢州',
            '江山', '江山',
            '瑞安', '瑞安',
            '绍兴', '绍兴',
            '嵊州', '嵊州',
            '台州', '台州',
            '温岭', '温岭',
            '温州', '温州',
   '余姚', '余姚',
   '舟山', '舟山'),
             
         '海外'
            => array(
            '美国(*)', '美国',
            '英国', '英国', 
            '法国', '法国', 
            '瑞士', '瑞士', 
            '澳洲', '澳洲', 
            '新西兰', '新西兰', 
            '加拿大', '加拿大', 
            '奥地利', '奥地利', 
            '韩国', '韩国', 
            '日本', '日本', 
            '德国', '德国', 
   '意大利', '意大利', 
   '西班牙', '西班牙', 
   '俄罗斯', '俄罗斯', 
   '泰国', '泰国', 
   '印度', '印度', 
   '荷兰', '荷兰', 
   '新加坡', '新加坡',
            '欧洲', '欧洲',
            '北美', '北美',
            '南美', '南美',
            '亚洲', '亚洲',
            '非洲', '非洲',
            '大洋洲', '大洋洲'));

    $areas = AreaExt::model()->findAll("parent=0 and name!='上海'");
    foreach ($areas as $key => $area) {
        foreach ($city_arr as $k=>$c) {
            if(in_array($area->name, $c)) {
                if($cid = Yii::app()->db->createCommand("select id from area where parent=0 and name='$k'")->queryScalar()) {
                    $area->parent = $cid;

                } else {
                    $onj = new AreaExt;
                    $onj->name = $k;
                    $onj->parent = 0;
                    $onj->save();
                    $area->parent = $onj->id;
                }
                if($area->save()) {
                    $ccid = $area->parent;
                    $aaid = $area->id;
                    Yii::app()->db->createCommand("update plot set city=$ccid where area=$aaid")->execute();
                }
            }
        }
        echo ($key+1).'/'.count($areas).'============================';
    }
    }
}